app/views/users/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 4]]
---

<h1><%= User.find(session[:user_id]).username %></h1>

    <% @user.posts.each do |post| %>

SELECT "tags".* FROM "tags"
---

              <%= posts_form.collection_check_boxes(:tag_ids, Tag.all, :id, :name)%>