app/helpers/posts_helper.rb

    def current_post
        Post.find_by(id: params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]