app/views/tags/show.html.erb


<% @tag.posts.each do |tag_post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "post_tags" ON "posts"."id" = "post_tags"."post_id" WHERE "post_tags"."tag_id" = ?  [["tag_id", 1]]