app/views/posts/_form.html.erb

SELECT "tags".* FROM "tags"
---
    <%= f.text_field :image_url%>
    <%= f.collection_select(:tag_ids, Tag.all, :id, :name)%>