app/views/posts/show.html.erb

<%= link_to image_tag(@post.image_url, width:320, height:320), @post%><br>
<% @post.tags.each do |tag|%>
---
SELECT "tags"."id" FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = ?  [["post_id", 5]]