app/controllers/comments_controller.rb

    def create
        @comment = @post.comments.build(comment_params)
        @comment.user_id = current_user.id
        if @comment.save
---
INSERT INTO "comments" ("description", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "ksdhkjd"], ["user_id", 7], ["post_id", 10], ["created_at", "2019-11-13 23:13:50.317306"], ["updated_at", "2019-11-13 23:13:50.317306"]]