app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "tags".* FROM "tags"
---
    def index
        if params[:q]
           @posts = Post.search_by_tags(params[:q])
        else
            @posts = Post.all

INSERT INTO "posts" ("image_url", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
        @post = current_user.posts.new(post_params)
        if @post.valid?
            @post.save

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 33]]
---
    def destroy
        @post.delete