app/controllers/tags_controller.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Fashion"], ["created_at", "2019-11-14 22:49:09.030362"], ["updated_at", "2019-11-14 22:49:09.030362"]]
---
    def create
        @tag = Tag.new(tag_params)
        if @tag.valid?
            @tag.save

DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 10]]
---
    def destroy
        @tag.delete

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_tag
        @tag = Tag.find(params[:id])