app/controllers/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("email", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

    def update
        if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "cat@gmail.com"], ["username", "Cat"], ["password_digest", "$2a$12$JwM.w//avPc4/VtHsyCxgO2atkpJVEJd.CEu4GYZVNnk1GG4iGTma"], ["updated_at", "2019-11-14 02:19:48.061152"], ["id", 8]]

    def show

        @comments = @user.comments
        if id_matches_current_user?(params[:id])
            @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]