app/models/post.rb

SELECT "tags".* FROM "tags"
---
    def self.search_by_tags(params)
        @tags = Tag.select{|tag| tag.name.downcase.include?(params.downcase)}